#  TD4 エミュレータ 利用マニュアル
<!-- pandoc -f markdown -t html5 -o README.html -c github.css README.md -->

## 1. 概要

本ツールは、渡波郁氏の著書 [CPUの創りかた](https://book.mynavi.jp/ec/products/detail/id=22065) で紹介された、学習や実験を目的に設計開発された4bit CPU「TD4 (**T**ada **D**ousa-suru-dake-no)」の動作をソフトウェア上で再現するエミュレータです。  
外部ファイルからプログラム（ROMデータ）を読み込み、コンソール画面上でレジスタやフラグの状態を表示しながら実行します。

**主な機能:**

* **トレース実行機能**: 1命令ずつ確認しながら実行可能（デバッグに最適）。
* **実行速度調整**: クロック周波数（待機時間）を任意に設定可能。
* **状態表示**: PC（プログラムカウンタ）、レジスタA/B、キャリーフラグ(C)、出力ポート(OUT)をリアルタイム表示。

## 2. 使用するTD4のバイナリ形式

本エミュレータが読み込むROMファイルは、**「テキスト形式の16進数リスト」** です。
バイナリファイル (.bin) ではなく、アセンブラが出力したHEXコードをテキストファイルとして保存したものを使用します。拡張子は、 (.hex) として下さい。 

### ファイルフォーマット仕様

* **1行につき1バイト**の命令コードを記述します。
* 値は **16進数（2桁）** で記述します（例: `30`, `F0`, `B1`）。
* 最大 **16行（16バイト）** まで読み込まれます（TD4の仕様）。
* 行の先頭に`;`があると、コメントとして無視されます。
* 空行は無視されます。

### ファイル内容の例 (`InOut.hex`)

```text
70
60
90
F0
```

## 3. コンパイル方法

本ツールはGo言語で記述されています。実行ファイルを生成するにはGoの開発環境が必要です。  
開発環境が、まだインストールされていない場合は、[Go言語公式サイト](https://go.dev/dl/)からインストーラーをダウンロードし、インストールしておいてください。  
ターミナル（WindowsならコマンドプロンプトやPowerShell、Mac/LinuxならTerminal）を開き、ソースコード(`main.go`)があるディレクトリで、以下のコマンドを入力して実行してください。  

### 手順

ターミナル（コマンドプロンプト）を開き、ソースコードがあるディレクトリで以下のコマンドを実行します。

**Windowsの場合:**

```cmd
go build -o td4emu.exe .\main.go
```

**Mac / Linuxの場合:**

```bash
go build -o td4emu main.go
```
※ 何もエラーが表示されずに終了すればコンパイル成功です。同じフォルダに実行ファイルが生成されます。

* **Windowsの場合:** `td4emu.exe` が生成されます。
* **Mac/Linuxの場合:** `td4emu` が生成されます。

## 4. 操作方法

コマンドライン引数として「hexファイル」を指定して起動します。  
オプションを指定することで実行モードを変更できます。  

### 基本コマンド

```bash
.\td4emu.exe [オプション] <hexファイル名>
```

### オプション一覧

| オプション | 引数 | デフォルト値 | 説明 |
| --- | --- | --- | --- |
| `-step` | なし | 無効 | **ステップ実行モード**を有効にします。Enterキーを押すたびに1命令進みます。 |
| `-speed` | 秒数 | `1000` | **通常実行時の待機時間**（ミリ秒）を指定します。値を小さくすると高速動作します。デフォルトでは、1秒（1000ミリ秒）に設定されています。 |



### 実行例

以下のソースコード `InOut.td4` を使用して、使用例を紹介します。
入力ポートからBレジスタに取り込んだ内容をそのまま出力ポートに送るだけのコードです。

```bash
> .\td4asm.exe -list -o InOut.hex .\InOut.td4

 ADDR      | BINARY    | HEX | SOURCE CODE
-----------|-----------|-----|----------------
 00 [0000] | 0111_0000 |  70 | MOV B, 0
 01 [0001] | 0110_0000 |  60 | IN B
 02 [0010] | 1001_0000 |  90 | OUT B
 03 [0011] | 1111_0000 |  F0 | JMP LOOP

Success! Generated 4 bytes.
Output saved to 'InOut.hex'
```

#### 画面表示の見方

実行中、コンソールには以下のようなCPUの内部状態が表示されます。

```text
| PC:00   | OP:70 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
```

* **PC** : プログラムカウンタ（現在の実行アドレス 00-15）
* **OP** : 実行中の命令コード（16進数）
* **A**  : Aレジスタの値 [2進数(10進数)]
* **B**  : Bレジスタの値 [2進数(10進数)]
* **C**  : キャリーフラグ（1=ON, 0=OFF）
* **IN** : 入力ポートの状態（物理スイッチのOnOff状態に相当）
* **OUT**: 出力ポートの状態（LEDの点灯状態に相当）

#### **1. 通常実行（1000 ミリ秒間隔）**

デフォルトの速度で実行します。動作確認に最適です。  
終了するには、`Ctrl+C`を入力して、強制終了して下さい。  

```bash
> .\td4emu.exe .\InOut.hex
4bit CPU TD4 emulator
Reading from the serial port...
Loaded .\InOut.hex. Starting Emulator...
Mode: Step=false, Speed= 1000ms/inst
| PC   BP |OP-code|A register |B register |Cflag| IN port | OUT port |
|:--------|:-----:|:---------:|:---------:|:---:|:-------:|:--------:|
| PC:00   | OP:70 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:01   | OP:60 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:02   | OP:90 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:03   | OP:F0 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:00   | OP:70 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:01   | OP:60 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:02   | OP:90 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:03   | OP:F0 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
   ...
   ...
   ...
```

#### **2. 実行速度の設定 **

デフォルトでは、1命令1秒（1000 ミリ秒）の間隔で動作しますが、speedオプションを指定することで、高速実行させることができます。  
以下は、0.2秒（200 ミリ秒）に設定する場合の指定方法です。  

```bash
td4emu -speed 200 Sample.hex
```

#### **3. トレース実行（デバッグモード）**  

手動で1命令ずつ実行していくことができます。  
1命令実行する毎にCPU状態(レジスタやフラグ等の内容)を表示できるので、レジスタの変化を検証しながら実行したい場合に使用します。  

```bash
 .\td4emu.exe -step .\InOut.hex
```

STEP実行では、以下のコマンドが実行できます。  
表示される**？**の後に、以下のコマンドを入力して下さい。

##### Q コマンド
**Q** : プログラムを終了します。

```bash
> .\td4emu.exe -step .\InOut.hex
4bit CPU TD4 emulator
Reading from the serial port...
Loaded .\InOut.hex. Starting Emulator...
Mode: Step=true, Speed= 1000ms/inst
| PC   BP |OP-code|A register |B register |Cflag| IN port | OUT port |
|:--------|:-----:|:---------:|:---------:|:---:|:-------:|:--------:|
| PC:00   | OP:70 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |

> Q
program terminated !
```
##### M コマンド

**M** : 現在のROM内容を表示します。  
以下は、M コマンドによる実行例です。  
プログラムを起動後、M コマンドでROM内容を表示しています。

```bash
> .\td4emu.exe -step .\Summation.hex
4bit CPU TD4 emulator
Reading from the serial port...
Loaded .\Summation.hex. Starting Emulator...
Mode: Step=true, Speed= 1000ms/inst
| PC   BP |OP-code|A register |B register |Cflag| IN port | OUT port |
|:--------|:-----:|:---------:|:---------:|:---:|:-------:|:--------:|
| PC:00   | OP:30 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
> M
| Adress | OP-code          |
|:-------|:----------------:|
|   00   | 0x30 0b0011_0000 |
|   01   | 0x01 0b0000_0001 |
|   02   | 0x02 0b0000_0010 |
|   03   | 0x04 0b0000_0100 |
|   04   | 0x08 0b0000_1000 |
|   05   | 0x40 0b0100_0000 |
|   06   | 0x90 0b1001_0000 |
|   07   | 0xF7 0b1111_0111 |
|   08   | 0x00 0b0000_0000 |
|   09   | 0x00 0b0000_0000 |
|   10   | 0x00 0b0000_0000 |
|   11   | 0x00 0b0000_0000 |
|   12   | 0x00 0b0000_0000 |
|   13   | 0x00 0b0000_0000 |
|   14   | 0x00 0b0000_0000 |
|   15   | 0x00 0b0000_0000 |
```

##### B コマンド

**B** adr : ブレークポイントの参照、設定と解除を行います。

デバッグするために、プログラムを一時停止させるアドレスの設定と解除を行います。

* 引数なしで実行すると現在設定されているブレークポイントを表示します。
* アドレスを指定して実行するとブレークポイントが設定されます。
* メモリの範囲外のアドレスを指定して実行するとブレークポイントが解除されます。

また、ブレークポイントを設定してから、Mコマンドを実行すると、アドレスの位置に'B'が実行されます。

ブレークポイントを設定してから、後述するTコマンド、Gコマンドを実行すると、その位置でプログラムを停止できます。

以下はその実行例です。

```bash
> .\td4emu.exe -step .\Summation.hex
4bit CPU TD4 emulator
Reading from the serial port...
Loaded .\Summation.hex. Starting Emulator...
Mode: Step=true, Speed= 1000ms/inst
| PC   BP |OP-code|A register |B register |Cflag| IN port | OUT port |
|:--------|:-----:|:---------:|:---------:|:---:|:-------:|:--------:|
| PC:00   | OP:30 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
> M
| Adress | OP-code          |
|:-------|:----------------:|
|   00   | 0x30 0b0011_0000 |
|   01   | 0x01 0b0000_0001 |
|   02   | 0x02 0b0000_0010 |
|   03   | 0x04 0b0000_0100 |
|   04   | 0x08 0b0000_1000 |
|   05   | 0x40 0b0100_0000 |
|   06   | 0x90 0b1001_0000 |
|   07   | 0xF7 0b1111_0111 |
|   08   | 0x00 0b0000_0000 |
> B 4
Break point: 4
> M
| Adress | OP-code          |
|:-------|:----------------:|
|   00   | 0x30 0b0011_0000 |
|   01   | 0x01 0b0000_0001 |
|   02   | 0x02 0b0000_0010 |
|   03   | 0x04 0b0000_0100 |
|   04 B | 0x08 0b0000_1000 |
|   05   | 0x40 0b0100_0000 |
|   06   | 0x90 0b1001_0000 |
|   07   | 0xF7 0b1111_0111 |
|   08   | 0x00 0b0000_0000 |
> T 8
| PC:01   | OP:01 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:02   | OP:02 | A:0001(1) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:03   | OP:04 | A:0011(3) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:04 B | OP:08 | A:0111(7) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
> B 17
Break point: none
> M
| Adress | OP-code          |
|:-------|:----------------:|
|   00   | 0x30 0b0011_0000 |
|   01   | 0x01 0b0000_0001 |
|   02   | 0x02 0b0000_0010 |
|   03   | 0x04 0b0000_0100 |
|   04   | 0x08 0b0000_1000 |
|   05   | 0x40 0b0100_0000 |
|   06   | 0x90 0b1001_0000 |
|   07   | 0xF7 0b1111_0111 |
|   08   | 0x00 0b0000_0000 |

```

##### T コマンド

**T** num : レジスタ表示しながら指定した回数だけトレース実行します。(nは、1以上の数値)

時間がかかる複雑な処理をトレース実行で1つ1つ動かしていくのは大変です。  
この機能は、機能がわかっている処理をまとめて実行し、結果だけを見たい場合などに使います。  
以下は、複数回の加算を行い、結果をOutPortに出力するものです。

1. Aレジスタで、1+2+4+8を計算する。
2. Aレジスタの内容をBレジスタにコピーする。
3. Bレジスタの内容をOutPortに出力する。
4. 現在のアドレスにジャンプして停止状態にする。

```bash
> type .\Summation.td4
; 加算	Summation
    MOV A, 0       ; Aレジスタに 0 を代入し、初期化
    ADD A, 0b00_01 ; Aレジスタに 1 を加算( 2進数)
    ADD A, 0o02    ; Aレジスタに 2 を加算( 8進数)
    ADD A, 4       ; Aレジスタに 4 を加算(10進数)
    ADD A, 0x8     ; Aレジスタに 8 を加算(16進数)
    MOV B, A       ; Aレジスタの値をBレジスタにコピーする。
    OUT B          ; Bレジスタの値を出力ポートに送る。
STOP:
    JMP STOP ; ここで無限ループにして、停止状態にする。

> .\td4asm.exe -o .\Summation.hex -list .\Summation.td4

 ADDR      | BINARY    | HEX | SOURCE CODE
-----------|-----------|-----|----------------
 00 [0000] | 0011_0000 |  30 | MOV A, 0
 01 [0001] | 0000_0001 |  01 | ADD A, 1
 02 [0010] | 0000_0010 |  02 | ADD A, 2
 03 [0011] | 0000_0100 |  04 | ADD A, 4
 04 [0100] | 0000_1000 |  08 | ADD A, 8
 05 [0101] | 0100_0000 |  40 | MOV B, A
 06 [0110] | 1001_0000 |  90 | OUT B
 07 [0111] | 1111_0111 |  F7 | JMP STOP

Success! Generated 8 bytes.
Output saved to '.\Summation.hex'
```

以下は、T コマンドによる実行例です。  
2行目で、5命令分をTコマンドで実行し、結果を出力するOUT命令の部分で停止しています。  
その後は、1命令づつトレース実行して結果を確認しています。  

```bash
> .\td4emu.exe -step .\Summation.hex
4bit CPU TD4 emulator
Reading from the serial port...
Loaded .\Summation.hex. Starting Emulator...
Mode: Step=true, Speed= 1000ms/inst
| PC   BP |OP-code|A register |B register |Cflag| IN port | OUT port |
|:--------|:-----:|:---------:|:---------:|:---:|:-------:|:--------:|
| PC:00   | OP:30 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
> T
| PC:01   | OP:01 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
> T 5
| PC:02   | OP:02 | A:0001(1) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:03   | OP:04 | A:0011(3) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:04   | OP:08 | A:0111(7) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:05   | OP:40 | A:1111(F) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:06   | OP:90 | A:1111(F) | B:1111(F) | C:0 | IN:0000 | OUT:0000 |
> Q
program terminated !
```

##### G コマンド

**G** adr : プログラムを連続実行します。

* 引数なしで実行すると現在のプログラムカウンタに設定されているアドレスから実行を開始します。
* 実行を開始するアドレスを指定して実行すると、そのアドレスをプログラムカウンタに設定してから実行を開始します。

G コマンドを一度実行すると、Ctrl+Cで、強制終了する以外に停止する術はありません。
必要に応じて、B コマンドで、ブレークポイントを設定してから、G コマンドを実行して下さい。
以下はその実行例です。

```bash
> .\td4emu.exe -step .\Summation.hex
4bit CPU TD4 emulator
Reading from the serial port...
Loaded .\Summation.hex. Starting Emulator...
Mode: Step=true, Speed= 1000ms/inst
| PC   BP |OP-code|A register |B register |Cflag| IN port | OUT port |
|:--------|:-----:|:---------:|:---------:|:---:|:-------:|:--------:|
| PC:00   | OP:30 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
> B 6
Break point: 6
> M
| Adress | OP-code          |
|:-------|:----------------:|
|   00   | 0x30 0b0011_0000 |
|   01   | 0x01 0b0000_0001 |
|   02   | 0x02 0b0000_0010 |
|   03   | 0x04 0b0000_0100 |
|   04   | 0x08 0b0000_1000 |
|   05   | 0x40 0b0100_0000 |
|   06 B | 0x90 0b1001_0000 |
|   07   | 0xF7 0b1111_0111 |
|   08   | 0x00 0b0000_0000 |
|   09   | 0x00 0b0000_0000 |
|   10   | 0x00 0b0000_0000 |
|   11   | 0x00 0b0000_0000 |
|   12   | 0x00 0b0000_0000 |
|   13   | 0x00 0b0000_0000 |
|   14   | 0x00 0b0000_0000 |
|   15   | 0x00 0b0000_0000 |
> T
| PC:01   | OP:01 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
> G 3
| PC:03   | OP:04 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:04   | OP:08 | A:0100(4) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:05   | OP:40 | A:1100(C) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:06 B | OP:90 | A:1100(C) | B:1100(C) | C:0 | IN:0000 | OUT:0000 |
> G 4
| PC:04   | OP:08 | A:1100(C) | B:1100(C) | C:0 | IN:0000 | OUT:0000 |
| PC:05   | OP:40 | A:0100(4) | B:1100(C) | C:1 | IN:0000 | OUT:0000 |
| PC:06 B | OP:90 | A:0100(4) | B:0100(4) | C:1 | IN:0000 | OUT:0000 |
> Q
program terminated !
```

##### I コマンド

**I**  num  : 入力ポートの値を設定します。(numは、0から15までの数値)  
IN 命令の直前に、このコマンドを実行すると、設定した値がIN 命令の実行結果に反映されます。  
値はGo言語の2進数、8進数、10進数、16進数表記で入力できます。

```bash
> .\td4emu.exe -step .\InOut.hex
4bit CPU TD4 emulator
Reading from the serial port...
Loaded .\InOut.hex. Starting Emulator...
Mode: Step=true, Speed= 1000ms/inst
| PC   BP |OP-code|A register |B register |Cflag| IN port | OUT port |
|:--------|:-----:|:---------:|:---------:|:---:|:-------:|:--------:|
| PC:00   | OP:70 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |

> T
| PC:01   | OP:60 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
> T
| PC:02   | OP:90 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
> I 0b1111
| PC:02   | OP:90 | A:0000(0) | B:0000(0) | C:0 | IN:1111 | OUT:0000 |
> I 5
| PC:02   | OP:90 | A:0000(0) | B:0000(0) | C:0 | IN:0101 | OUT:0000 |
> I 0o16
| PC:02   | OP:90 | A:0000(0) | B:0000(0) | C:0 | IN:1110 | OUT:0000 |
> I 0xA
| PC:02   | OP:90 | A:0000(0) | B:0000(0) | C:0 | IN:1010 | OUT:0000 |
> Q
program terminated !
```

##### S コマンド

**S** adr val : 指定したアドレスのメモリ内容を書き換えます。  
定数を変更した時に結果がどの様に変わるかを試行錯誤していく場合に、毎回、ソースコードを編集してアセンブルし直していたのでは、手間と時間の無駄です。  
そのような場合に、直接、修正したい部分のコードを書き換えるためのコマンドです。
以下は、複数回の加算を行い、結果をOutPortに出力するものです。

1. Aレジスタで、1+2+4+8を計算する。
2. Aレジスタの内容をBレジスタにコピーする。
3. Bレジスタの内容をOutPortに出力する。
4. 現在のアドレスにジャンプして停止状態にする。

```bash
> type .\Summation.td4
; 加算	Summation
    MOV A, 0       ; Aレジスタに 0 を代入し、初期化
    ADD A, 0b00_01 ; Aレジスタに 1 を加算( 2進数)
    ADD A, 0o02    ; Aレジスタに 2 を加算( 8進数)
    ADD A, 4       ; Aレジスタに 4 を加算(10進数)
    ADD A, 0x8     ; Aレジスタに 8 を加算(16進数)
    MOV B, A       ; Aレジスタの値をBレジスタにコピーする。
    OUT B          ; Bレジスタの値を出力ポートに送る。
STOP:
    JMP STOP ; ここで無限ループにして、停止状態にする。

> .\td4asm.exe -o .\Summation.hex -list .\Summation.td4

 ADDR      | BINARY    | HEX | SOURCE CODE
-----------|-----------|-----|----------------
 00 [0000] | 0011_0000 |  30 | MOV A, 0
 01 [0001] | 0000_0001 |  01 | ADD A, 1
 02 [0010] | 0000_0010 |  02 | ADD A, 2
 03 [0011] | 0000_0100 |  04 | ADD A, 4
 04 [0100] | 0000_1000 |  08 | ADD A, 8
 05 [0101] | 0100_0000 |  40 | MOV B, A
 06 [0110] | 1001_0000 |  90 | OUT B
 07 [0111] | 1111_0111 |  F7 | JMP STOP

Success! Generated 8 bytes.
Output saved to '.\Summation.hex'
```

以下は、S コマンドによる実行例です。  
プログラムを起動後、M コマンドでROM内容を表示しています。
次に、アドレス2番地の加算値を2から3に変更しています。
再度、M コマンドでROM内容を表示し、内容が更新されていることを確認しています。

```bash
> .\td4emu.exe -step .\Summation.hex
4bit CPU TD4 emulator
Reading from the serial port...
Loaded .\Summation.hex. Starting Emulator...
Mode: Step=true, Speed= 1000ms/inst
| PC   BP |OP-code|A register |B register |Cflag| IN port | OUT port |
|:--------|:-----:|:---------:|:---------:|:---:|:-------:|:--------:|
| PC:00   | OP:30 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
> M
| Adress | OP-code          |
|:-------|:----------------:|
|   00   | 0x30 0b0011_0000 |
|   01   | 0x01 0b0000_0001 |
|   02   | 0x02 0b0000_0010 |
|   03   | 0x04 0b0000_0100 |
|   04   | 0x08 0b0000_1000 |
|   05   | 0x40 0b0100_0000 |
|   06   | 0x90 0b1001_0000 |
|   07   | 0xF7 0b1111_0111 |
|   08   | 0x00 0b0000_0000 |
|   09   | 0x00 0b0000_0000 |
|   10   | 0x00 0b0000_0000 |
|   11   | 0x00 0b0000_0000 |
|   12   | 0x00 0b0000_0000 |
|   13   | 0x00 0b0000_0000 |
|   14   | 0x00 0b0000_0000 |
|   15   | 0x00 0b0000_0000 |
> S 0x02 0b00_11
|   02   | 0x03 0b0000_0011 |

> M
| Adress | OP-code          |
|:-------|:----------------:|
|   00   | 0x30 0b0011_0000 |
|   01   | 0x01 0b0000_0001 |
|   02   | 0x03 0b0000_0011 |
|   03   | 0x04 0b0000_0100 |
|   04   | 0x08 0b0000_1000 |
|   05   | 0x40 0b0100_0000 |
|   06   | 0x90 0b1001_0000 |
|   07   | 0xF7 0b1111_0111 |
|   08   | 0x00 0b0000_0000 |
|   09   | 0x00 0b0000_0000 |
|   10   | 0x00 0b0000_0000 |
|   11   | 0x00 0b0000_0000 |
|   12   | 0x00 0b0000_0000 |
|   13   | 0x00 0b0000_0000 |
|   14   | 0x00 0b0000_0000 |
|   15   | 0x00 0b0000_0000 |
```

##### V コマンド

**V** time : 実行速度を設定します。

1命令の実行時間を設定します。単位は、ミリ秒単位です。
デフォルトの実行時間は1000ms(1秒)に設定されていますが、

以下の実行例は、V コマンドで、1命令の実行時間を200msに設定しています。

```bash
> .\td4emu.exe -step .\Summation.hex
4bit CPU TD4 emulator
Reading from the serial port...
Loaded .\Summation.hex. Starting Emulator...
Mode: Step=true, Speed= 1000ms/inst
| PC   BP |OP-code|A register |B register |Cflag| IN port | OUT port |
|:--------|:-----:|:---------:|:---------:|:---:|:-------:|:--------:|
| PC:00   | OP:30 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
> V 200
Speed=  200ms/inst
> T 8
| PC:01   | OP:01 | A:0000(0) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:02   | OP:02 | A:0001(1) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:03   | OP:04 | A:0011(3) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:04   | OP:08 | A:0111(7) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:05   | OP:40 | A:1111(F) | B:0000(0) | C:0 | IN:0000 | OUT:0000 |
| PC:06   | OP:90 | A:1111(F) | B:1111(F) | C:0 | IN:0000 | OUT:0000 |
| PC:07   | OP:F7 | A:1111(F) | B:1111(F) | C:0 | IN:0000 | OUT:1111 |
| PC:07   | OP:F7 | A:1111(F) | B:1111(F) | C:0 | IN:0000 | OUT:1111 |
```

## 5. 使用上の注意点と制約

1. **入力ポート（IN）の制限**
* 現在の実装では、入力ポート（IN A, IN B命令で参照される値）は初期状態では **`0000` 固定** となっています。
* トレース実行モードでIN命令の前に、Iコマンドで入力ポートの値を設定することで、外部スイッチによる入力をエミュレートできます。

2. **16バイト制限**
* 読み込むファイルが16行を超えている場合、17行目以降のデータは無視（または切り捨て）されます。


3. **16バイト以上のメモリ空間へのアクセス**
もし、メモリ上限の16バイト以上の空間をアクセスした場合は、プログラムカウンタは0に戻ります。  
通常のコンピュータは、エラーを発生するはずですが、このエミュレータでは、プログラムカウンタに０がセットされ、メモリの最初から実行されます。  
うまく使うと、16バイトを使い切り、無限ループするプログラムを作成できます。  

<!--
3. **画面クリアについて**
* 多くの環境で動作させるため、画面のクリア（リフレッシュ）処理は簡易的な実装（または追記形式）となっています。長時間実行するとログが流れ続けます。


4. **未定義命令の挙動**
* TD4の仕様にない命令コード（Opcode）が含まれていた場合、エミュレータは何もしない（NOP相当）か、予期しない挙動をする可能性があります。必ずアセンブラを通した正しいコードを使用してください。
-->